### Pandas Series

A Series is a one-dimensional labeled array.

Think of it like:

A single column of a table

Or a vector with labels (index)

In [6]:
import pandas as pd

In [2]:
s = pd.Series([10, 20, 30, 40])
s

0    10
1    20
2    30
3    40
dtype: int64

In [3]:
#series with custom index
marks = pd.Series([85, 90, 88], index=["Ananda", "Sita", "Ram"])
marks

Ananda    85
Sita      90
Ram       88
dtype: int64

In [4]:
marks[0]

C:\Users\anand\AppData\Local\Temp\ipykernel_236288\1318454221.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  marks[0]

np.int64(85)

# Pandas DataFrame (2-D data)
What is a DataFrame?

A DataFrame is a table (rows + columns), like Excel or SQL table

In [5]:
df = pd.DataFrame({
    "Name": ["Ananda", "Sita", "Ram"],
    "Age": [22, 21, 23],
    "Score": [85, 90,85]
})

df

     Name  Age  Score
0  Ananda   22     85
1    Sita   21     90
2     Ram   23     85

### Select Columns (very important)
#### Single column → Series
### Multiple columns → DataFrame

In [7]:
df["Age"]

0    22
1    21
2    23
Name: Age, dtype: int64

In [ ]:
df[["Name", "Score"]]

In [8]:
### Now use all the general method for this dataframe like and find first 2 data last two data info and shape
df.head()

     Name  Age  Score
0  Ananda   22     85
1    Sita   21     90
2     Ram   23     85

In [9]:
df.tail(5)

     Name  Age  Score
0  Ananda   22     85
1    Sita   21     90
2     Ram   23     85

In [10]:
df.shape

(3, 3)

In [11]:
df.head(1)

     Name  Age  Score
0  Ananda   22     85

In [17]:
df.sample()

     Name  Age  Score
0  Ananda   22     85

In [21]:

df = pd.DataFrame({
    "Name": [
        "Ananda", "Sita", "Ram", "Gita", "Hari", "Nita", "Ravi", "Pooja", "Kiran", "Maya",
        "Amit", "Sneha", "Rohan", "Anita", "Bikash", "Nisha", "Rahul", "Puja", "Suman", "Kavita",
        "Arjun", "Neha", "Sagar", "Rita", "Manish", "Sunita", "Deepak", "Priya", "Rohit", "Alina",
        "Vikas", "Mina", "Nabin", "Komal", "Dipesh", "Laxmi", "Prakash", "Isha", "Niraj", "Asha",
        "Suraj", "Riya", "Santosh", "Anjali", "Hemant", "Pawan", "Monika", "Ashok", "Preeti", "Sonia"
    ],
    "Age": [
        22, 21, 23, 20, 22, 21, 23, 20, 22, 21,
        23, 20, 22, 21, 23, 20, 22, 21, 23, 20,
        22, 21, 23, 20, 22, 21, 23, 20, 22, 21,
        23, 20, 22, 21, 23, 20, 22, 21, 23, 20,
        22, 21, 23, 20, 22, 21, 23, 20, 22, 21
    ],
    "Score": [
        85, 90, 88, 76, 92, 81, 87, 79, 84, 90,
        86, 78, 91, 83, 89, 80, 88, 82, 90, 77,
        85, 84, 92, 79, 88, 81, 90, 83, 87, 86,
        91, 78, 84, 82, 89, 80, 88, 85, 92, 77,
        90, 83, 91, 79, 86, 84, 88, 81, 90, 85
    ]
})

df

       Name  Age  Score
0    Ananda   22     85
1      Sita   21     90
2       Ram   23     88
3      Gita   20     76
4      Hari   22     92
5      Nita   21     81
6      Ravi   23     87
7     Pooja   20     79
8     Kiran   22     84
9      Maya   21     90
10     Amit   23     86
11    Sneha   20     78
12    Rohan   22     91
13    Anita   21     83
14   Bikash   23     89
15    Nisha   20     80
16    Rahul   22     88
17     Puja   21     82
18    Suman   23     90
19   Kavita   20     77
20    Arjun   22     85
21     Neha   21     84
22    Sagar   23     92
23     Rita   20     79
24   Manish   22     88
25   Sunita   21     81
26   Deepak   23     90
27    Priya   20     83
28    Rohit   22     87
29    Alina   21     86
30    Vikas   23     91
31     Mina   20     78
32    Nabin   22     84
33    Komal   21     82
34   Dipesh   23     89
35    Laxmi   20     80
36  Prakash   22     88
37     Isha   21     85
38    Niraj   23     92
39     Asha   20     77
40    Suraj   22     90
41     Riya   21     83
42  Santosh   23     91
43   Anjali   20     79
44   Hemant   22     86
45    Pawan   21     84
46   Monika   23     88
47    Ashok   20     81
48   Preeti   22     90
49    Sonia   21     85

In [22]:
# save the generated data into local system
df.to_csv('data.csv', index=False)  # index=False avoids adding row numbers

In [24]:
# apply all the analysis like info shape ,describe and others things in your data and find the first 10 and last 10 data 
df.head(10)

     Name  Age  Score
0  Ananda   22     85
1    Sita   21     90
2     Ram   23     88
3    Gita   20     76
4    Hari   22     92
5    Nita   21     81
6    Ravi   23     87
7   Pooja   20     79
8   Kiran   22     84
9    Maya   21     90

In [25]:
df.sample()

     Name  Age  Score
20  Arjun   22     85

In [26]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 50 entries, 0 to 49
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    50 non-null     object
 1   Age     50 non-null     int64
 2   Score   50 non-null     int64
dtypes: int64(2), object(1)
memory usage: 1.3+ KB

In [28]:
df.describe()

             Age      Score
count  50.000000  50.000000
mean   21.500000  85.080000
std     1.111168   4.606296
min    20.000000  76.000000
25%    21.000000  81.250000
50%    21.500000  85.000000
75%    22.000000  89.000000
max    23.000000  92.000000

In [ ]:
# your task generate the another data using the list

### you can add your own note below using pandas offical documentation https://pandas.pydata.org/docs/

### your task find and write the detailed comparison between series and dataframe with code example